In [62]:
import pandas as pd
import os

In [63]:
pwd = os.getcwd()

In [64]:
mb = pd.read_csv(pwd + '/Data - Map Banned.csv', usecols=['Map','Total']).iloc[1:]
mp = pd.read_csv(pwd + '/Data - Map Picked.csv', usecols=['Map','Total'])
ps = pd.read_csv(pwd + '/Data - Player Statistics.csv')
ss = pd.read_csv(pwd + '/Data - Side Statistics.csv')

In [65]:
mb

        Map  Total
1    Ascent     18
2      Bind     15
3  Fracture     29
4     Haven     22
5     Lotus     18
6     Pearl     18
7     Split     12

In [66]:
mp

        Map  Total
0    Ascent     16
1      Bind     19
2  Fracture      5
3     Haven     12
4     Lotus     16
5     Pearl     16
6     Split     22

In [67]:
ps.head()

,Player,Country,Team,Agents,Maps,K,D,A,KD,KDA,ACS/Map,K/Map,D/Map,A/Map
0,Keznit,Chile,KRÜ Esports,"['Raze', 'Jett']",4,79,70,21,1.12,1.42,266,19.7,17.5,5.2
1,Whz,China,Bilibili Gaming,"['Raze', 'Jett']",11,212,181,41,1.17,1.39,254,19.2,16.4,3.7
2,Demon1,United States,Evil Geniuses,"['Jett', 'Astra', 'Chamber']",21,421,302,80,1.39,1.65,246,20.0,14.3,3.8
3,Aspas,Brazil,LOUD,"['Raze', 'Jett']",24,446,355,82,1.25,1.48,235,18.5,14.7,3.4
4,Jinggg,Singapore,Paper Rex,"['Raze', 'Phoenix']",16,285,279,92,1.02,1.35,234,17.8,17.4,5.7

In [68]:
ss

        Map  Atk Wins  Def Wins
0    Ascent       145       138
1      Bind       157       183
2  Fracture        51        53
3     Haven       107       109
4     Lotus       151       123
5     Pearl       149       151
6     Split       178       138

In [73]:
map_data = pd.merge(mp,mb, on='Map')
map_data = pd.merge(map_data,ss, on='Map')
map_data

        Map  Total_x  Total_y  Atk Wins  Def Wins
0    Ascent       16       18       145       138
1      Bind       19       15       157       183
2  Fracture        5       29        51        53
3     Haven       12       22       107       109
4     Lotus       16       18       151       123
5     Pearl       16       18       149       151
6     Split       22       12       178       138

In [76]:
map_data.rename(columns={'Total_x':'Picked', 'Total_y':'Banned'})
map_data

        Map  Total_x  Total_y  Atk Wins  Def Wins
0    Ascent       16       18       145       138
1      Bind       19       15       157       183
2  Fracture        5       29        51        53
3     Haven       12       22       107       109
4     Lotus       16       18       151       123
5     Pearl       16       18       149       151
6     Split       22       12       178       138